// CPPBasic.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//
#include <iostream>

int main()
{
	int num;
	std::cin >> num;
	std::cout << "num의 값: " << num<< "사용자가 입력하셨습니다"<< num-1<<"가능한가"<<num*10.1 ;
	//num의 값: 13 사용자가 입력하셨습니다 12 가능한가 131.3 
   //주의점: 10.0을 곱하면130.0이 아닌  정수형태 나오는데, 10.1을 곱하면 실수로 나옴.
}



// 시작을 위한 팁: 
//   1. [솔루션 탐색기] 창을 사용하여 파일을 추가/관리합니다.
//   2. [팀 탐색기] 창을 사용하여 소스 제어에 연결합니다.
//   3. [출력] 창을 사용하여 빌드 출력 및 기타 메시지를 확인합니다.
//   4. [오류 목록] 창을 사용하여 오류를 봅니다.
//   5. [프로젝트] > [새 항목 추가]로 이동하여 새 코드 파일을 만들거나, [프로젝트] > [기존 항목 추가]로 이동하여 기존 코드 파일을 프로젝트에 추가합니다.
//   6. 나중에 이 프로젝트를 다시 열려면 [파일] > [열기] > [프로젝트]로 이동하고 .sln 파일을 선택합니다.